# Дана последовательность символов
s = '(etnfづzxfk｡12dt◕`1ad‿6hns‿1zQY◕Cd$y｡FtSq)Ze6?づ#2)$'

# Вывести каждый 5й элемент последовательности.
print(s[::5])
