"""
Задача 6. 5 баллов. Тема Кортеж и работа сним.

Удалить элемент из кортежа.
Входные данные: (1, 2, 3)
Результат: (1, 2)
"""
# Создаём кортеж 1
t1 = (1, 2, 3)
# создаём кортеж 2 исполльзуя срез с кортежа 1
t2 = t1[0:2]
# выводим кортеж 2
print(t2)
